In [1]:
pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in c:\users\spunk\appdata\roaming\python\python311\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\spunk\appdata\roaming\python\python311\site-packages (from mysql-connector-python) (3.20.3)
Note: you may need to restart the kernel to use updated packages.

In [1]:
# Importing the libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name,user_name,user_password):
    
    global connection
    connection = None
    
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
            password = user_password
        )
        print("MySQL connection Successfull")
        
    except Error as er:
        print(f"Error: {er}")
        
    return connection

ps = "1234"

db = "Internship1"

create_server_connection("localhost","root",ps)

MySQL connection Successfull

In [3]:
# Create Database Internship

def create_database(connection,query):
    cursor = connection.cursor()
    
    try:
        cursor.execute(query)
        print("Database Created Successfully")
        
    except Error as er:
        print(f"Error: {er}")
        
create_database_query = "Create Database Internship1"
create_database(connection,create_database_query)
# create_database(connection,"Create Database Internship")

Database Created Successfully

In [10]:
# connect to database

def create_db_connection(host_name,user_name,user_password,db_name):
    connection = None
    
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password,
        database = db_name
        )
        print("MYSQL Database Connection Successful")
        
    except Error as er:
        print(f"Error: {er}")
        
    return connection

In [11]:
# Execute SQL Queries

global cursor
def execute_query(connection,query):
    cursor = connection.cursor()
    
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was Successful")
        
    except Error as er:
        print(f"Error: {er}")

In [12]:
create_orders_table = """
Create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(30) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(30));
"""

# connect to the database

connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,create_orders_table)

MYSQL Database Connection Successful
Error: 1050 (42S01): Table 'orders' already exists

In [26]:
# insert data

data_orders = """
insert into orders values
(101,'Steve',"laptop","2008-06-12",2,800,"9654875412"),
(102, 'Jos', 'Books', '2019-02-10', 10, 12, '8367489124'),
(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645'),
(104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099'),
(105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698'), 
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7720130449');
"""

connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,data_orders)

MYSQL Database Connection Successful
Query was Successful

In [13]:
def read_query(connection,query):
    cursor = connection.cursor()
    results = None
    
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as er:
        print(f"Error: {er}")

In [30]:
# Using Select statement

Q1 = """
Select * from orders;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q1)

for result in results:
    print(result)

MYSQL Database Connection Successful
(101, 'PREETI AGARWAL', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [15]:
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
    
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity",
"unit_price", "phone_number"]

df = pd.DataFrame(from_db,columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,laptop,2008-06-12,2,800.0,9654875412
1,102,Jos,Books,2019-02-10,10,12.0,8367489124
2,103,Stacy,Trousers,2019-12-25,5,50.0,8976123645
3,104,Nancy,T-Shirts,2018-07-14,7,30.0,7368145099
4,105,Maria,Headphones,2019-05-30,6,48.0,8865316698
5,106,Danny,Smart TV,2018-08-20,10,300.0,7720130449

In [16]:
Q2 = """
SELECT DISTINCT year(date_ordered) FROM orders;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q2)

for result in results:
    print(result)

MYSQL Database Connection Successful
(2008,)
(2019,)
(2018,)

1- delete a row
2- upadate a record
3- fetch some condtion ( unit price is greater or smaller )
4- query with order by
5- select * from orders;

In [36]:
print("\n\nBefore Deleting the row from table\n")
fetchB="""
Select * from orders;
"""
connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,fetchB)
for result in results:
    print(result)
    
#deleting the row    

Q3= """
DELETE FROM orders WHERE order_id = 101;
"""
connection = create_db_connection("localhost","root",ps,db)
results = execute_query(connection,Q3)

#after deleteing the row 
fetch1 = """
Select * from orders;
"""
connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,fetch1)
print("\n\nAfter Deleting the row from table\n")
for result in results:
    print(result)

Before Deleting the row from table

MYSQL Database Connection Successful
(101, 'Steve', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')
MYSQL Database Connection Successful
Query was Successful
MYSQL Database Connection Successful


After Deleting the row from table

(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [38]:
restoring1="""
insert into orders values
(101,'Steve',"laptop","2008-06-12",2,800,"9654875412")
"""

connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,data_orders)

MYSQL Database Connection Successful
Query was Successful

In [47]:
print("\n\nBefore Updating the row\n")
fetchB="""
Select * from orders;
"""
connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,fetchB)
for result in results:
    print(result)
    
Q4="""
UPDATE orders 
SET customer_name = 'PREETI' 
WHERE order_id = 101;
"""
connection = create_db_connection("localhost","root",ps,db)
results = execute_query(connection,Q4)

print("\n\After Updating the row\n")
fetchB="""
Select * from orders;
"""
connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,fetchB)
for result in results:
    print(result)

Before Updating the row

MYSQL Database Connection Successful
(101, 'steve', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')
MYSQL Database Connection Successful
Query was Successful

\After Updating the row

MYSQL Database Connection Successful
(101, 'PREETI', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [46]:
restoring="""
UPDATE orders 
SET customer_name = 'steve' 
WHERE order_id = 101;
"""
connection = create_db_connection("localhost","root",ps,db)
results = execute_query(connection,restoring)

MYSQL Database Connection Successful
Query was Successful

In [48]:
Q5= """
SELECT * FROM orders where unit_price>100 and unit_price<1000;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q5)

for result in results:
    print(result)

MYSQL Database Connection Successful
(101, 'PREETI', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [49]:
Q6="""
SELECT *
FROM orders
ORDER BY customer_name;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q6)

for result in results:
    print(result)

MYSQL Database Connection Successful
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(101, 'PREETI', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')